Acquiring state lock. This may take a few moments...
module.lambda_layer.data.archive_file.pymysql_layer: Reading...
module.lambda_layer.data.archive_file.pymysql_layer: Read complete after 0s [id=fdbcd5e1107f297ea43bc9c2c8cf137dabe8d5aa]
module.iam.aws_iam_role.eks_node_role: Refreshing state... [id=EKSNodeInstanceRole]
module.lambda_layer.aws_lambda_layer_version.pymysql: Refreshing state... [id=arn:aws:lambda:ap-northeast-2:635140758252:layer:pymysql-layer:13]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0b826106de35fb936]
module.iam.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_sql_initializer_policy]
module.iam.aws_iam_policy.lambda_vpc_access_policy: Refreshing state... [id=arn:aws:iam::635140758252:policy/lambda_vpc_access_policy]
module.nat.aws_eip.nat_eip: Refreshing state... [id=eipalloc-0609500ba746c93b8]
module.iam.aws_iam_role.eks_cluster_role: Refreshing state... [id=EKSClusterRole]
module.iam.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_sql_initializer_role]
module.iam.aws_iam_role_policy_attachment.eks_cni: Refreshing state... [id=EKSNodeInstanceRole-20250610065947054300000005]
module.iam.aws_iam_role_policy_attachment.ec2_container_registry_read_only: Refreshing state... [id=EKSNodeInstanceRole-20250610065947071400000006]
module.iam.aws_iam_role_policy_attachment.eks_worker_node: Refreshing state... [id=EKSNodeInstanceRole-20250610065947035200000004]
module.iam.aws_iam_role_policy_attachment.lambda_vpc_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250610065947007700000002]
module.iam.aws_iam_role_policy_attachment.lambda_policy_attachment: Refreshing state... [id=lambda_sql_initializer_role-20250610065947019000000003]
module.iam.aws_iam_role_policy_attachment.eks_cluster_attach: Refreshing state... [id=EKSClusterRole-20250610065946999700000001]
module.route.aws_route_table.private: Refreshing state... [id=rtb-0cfb41b263c41f1f7]
module.subnet.aws_subnet.private_3b: Refreshing state... [id=subnet-051250c81f967ceb2]
module.subnet.aws_subnet.public_1a: Refreshing state... [id=subnet-0b89944933a5859ca]
module.subnet.aws_subnet.public_2c: Refreshing state... [id=subnet-02b66acb56ba44361]
module.security_group.aws_security_group.app_sg: Refreshing state... [id=sg-024f6ed325a07f4f6]
module.igw.aws_internet_gateway.this: Refreshing state... [id=igw-0588672746d41d49c]
module.route.aws_route_table.public: Refreshing state... [id=rtb-05e8c39a88eb3f60c]
module.subnet.aws_subnet.private_4d: Refreshing state... [id=subnet-00eb11ee15b0636af]
module.nat.aws_nat_gateway.nat: Refreshing state... [id=nat-0b5710ecd23334d1d]
module.security_group.aws_security_group.rds_sg: Refreshing state... [id=sg-06e871a038117de2d]
module.route.aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-00d75b1be5cbdcb09]
module.route.aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-0ea78141d2e2744ef]
module.route.aws_route.public_route: Refreshing state... [id=r-rtb-05e8c39a88eb3f60c1080289494]
module.route.aws_route.private_route: Refreshing state... [id=r-rtb-0cfb41b263c41f1f71080289494]
module.route.aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-05a854dba16a310f8]
module.route.aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-0963912ebd94fdec0]
module.eks.aws_eks_cluster.this: Refreshing state... [id=news-cluster]
data.aws_eks_cluster.this: Reading...
module.eks.aws_eks_node_group.default: Refreshing state... [id=news-cluster:news-cluster-ng]
data.aws_eks_cluster.this: Read complete after 0s [id=news-cluster]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=news-rds]
module.rds.aws_db_instance.this: Refreshing state... [id=db-IKHKA6JZSTZQ2CIDVYB7MG5IPQ]
module.sql_initializer.aws_lambda_function.sql_initializer: Refreshing state... [id=rds-sql-initializer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.aws_ecr_lifecycle_policy.spring_app will be created
  + resource "aws_ecr_lifecycle_policy" "spring_app" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images older than 1 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "spring-app"
    }

  # module.security_group.aws_security_group_rule.allow_eks_app_to_rds will be created
  + resource "aws_security_group_rule" "allow_eks_app_to_rds" {
      + description              = "Allow EKS app access to RDS"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-06e871a038117de2d"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-06c76e0ed5035e749"
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.sql_initializer.data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/sql_initializer/sql_init.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/lambda/sql_initializer"
      + type                = "zip"
    }

  # module.sql_initializer.aws_lambda_function.sql_initializer will be updated in-place
  ~ resource "aws_lambda_function" "sql_initializer" {
        id                             = "rds-sql-initializer"
      ~ last_modified                  = "2025-06-10T07:12:04.137+0000" -> (known after apply)
      ~ source_code_hash               = "jeViXMzO5qYmmeHmK0pj1PU1pFsE394OfwQsER6M3Qw=" -> (known after apply)
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

<!-- Sticky Pull Request Comment -->